# CanFlipEnds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralFramingUtils..::..CanFlipEnds Method
StructuralFramingUtils Class See Also
---
Determines if the ends of the given framing element can be flipped.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public static bool CanFlipEnds(
	FamilyInstance familyInstance
)
```

Visual Basic
---
```text
Public Shared Function CanFlipEnds ( _
	familyInstance As FamilyInstance _
) As Boolean
```

Visual C++
---
```text
public:
static bool CanFlipEnds(
	FamilyInstance^ familyInstance
)
```

# ### Parameters
familyInstance
    Type: Autodesk.Revit.DB..::..FamilyInstance The FamilyInstance, which must be of a structural framing category, non-concrete.
# ### Return Value
True for non-concrete line, arc or ellipse framing element, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace